docs/evidence/02-outbox-pattern/solution/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /tmp/test-evidence/order-load.js
        output: Prometheus remote write (http://34.64.219.137:30090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m30s max duration (incl. graceful stop):
              * constant_load: 5 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m01.0s/1m0s

running (0m02.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
constant_load   [   3% ] 5 VUs  0m02.0s/1m0s

running (0m03.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m03.0s/1m0s

running (0m04.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m04.0s/1m0s

running (0m05.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
constant_load   [   8% ] 5 VUs  0m05.0s/1m0s

running (0m06.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m06.0s/1m0s

running (0m07.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m07.0s/1m0s

running (0m08.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
constant_load   [  13% ] 5 VUs  0m08.0s/1m0s

running (0m09.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m09.0s/1m0s

running (0m10.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m10.0s/1m0s

running (0m11.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
constant_load   [  18% ] 5 VUs  0m11.0s/1m0s

running (0m12.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m12.0s/1m0s

running (0m13.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m13.0s/1m0s

running (0m14.0s), 5/5 VUs, 54 complete and 0 interrupted iterations
constant_load   [  23% ] 5 VUs  0m14.0s/1m0s

running (0m15.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  0m15.0s/1m0s

running (0m16.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  0m16.0s/1m0s

running (0m17.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
constant_load   [  28% ] 5 VUs  0m17.0s/1m0s

running (0m18.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  0m18.0s/1m0s

running (0m19.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  0m19.0s/1m0s

running (0m20.0s), 5/5 VUs, 81 complete and 0 interrupted iterations
constant_load   [  33% ] 5 VUs  0m20.0s/1m0s

running (0m21.0s), 5/5 VUs, 86 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  0m21.0s/1m0s

running (0m22.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  0m22.0s/1m0s

running (0m23.0s), 5/5 VUs, 96 complete and 0 interrupted iterations
constant_load   [  38% ] 5 VUs  0m23.0s/1m0s

running (0m24.0s), 5/5 VUs, 101 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  0m24.0s/1m0s

running (0m25.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  0m25.0s/1m0s

running (0m26.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  0m26.0s/1m0s

running (0m27.0s), 5/5 VUs, 113 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  0m27.0s/1m0s

running (0m28.0s), 5/5 VUs, 118 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  0m28.0s/1m0s

running (0m29.0s), 5/5 VUs, 123 complete and 0 interrupted iterations
constant_load   [  48% ] 5 VUs  0m29.0s/1m0s

running (0m30.0s), 5/5 VUs, 128 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  0m30.0s/1m0s

running (0m31.0s), 5/5 VUs, 131 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  0m31.0s/1m0s

running (0m32.0s), 5/5 VUs, 137 complete and 0 interrupted iterations
constant_load   [  53% ] 5 VUs  0m32.0s/1m0s

running (0m33.0s), 5/5 VUs, 141 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  0m33.0s/1m0s

running (0m34.0s), 5/5 VUs, 148 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  0m34.0s/1m0s

running (0m35.0s), 5/5 VUs, 153 complete and 0 interrupted iterations
constant_load   [  58% ] 5 VUs  0m35.0s/1m0s

running (0m36.0s), 5/5 VUs, 156 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  0m36.0s/1m0s

running (0m37.0s), 5/5 VUs, 161 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  0m37.0s/1m0s

running (0m38.0s), 5/5 VUs, 166 complete and 0 interrupted iterations
constant_load   [  63% ] 5 VUs  0m38.0s/1m0s

running (0m39.0s), 5/5 VUs, 171 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  0m39.0s/1m0s

running (0m40.0s), 5/5 VUs, 173 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  0m40.0s/1m0s

running (0m41.0s), 5/5 VUs, 178 complete and 0 interrupted iterations
constant_load   [  68% ] 5 VUs  0m41.0s/1m0s

running (0m42.0s), 5/5 VUs, 183 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  0m42.0s/1m0s

running (0m43.0s), 5/5 VUs, 188 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  0m43.0s/1m0s

running (0m44.0s), 5/5 VUs, 195 complete and 0 interrupted iterations
constant_load   [  73% ] 5 VUs  0m44.0s/1m0s

running (0m45.0s), 5/5 VUs, 200 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  0m45.0s/1m0s

running (0m46.0s), 5/5 VUs, 205 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  0m46.0s/1m0s

running (0m47.0s), 5/5 VUs, 212 complete and 0 interrupted iterations
constant_load   [  78% ] 5 VUs  0m47.0s/1m0s

running (0m48.0s), 5/5 VUs, 217 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  0m48.0s/1m0s

running (0m49.0s), 5/5 VUs, 223 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  0m49.0s/1m0s

running (0m50.0s), 5/5 VUs, 229 complete and 0 interrupted iterations
constant_load   [  83% ] 5 VUs  0m50.0s/1m0s

running (0m51.0s), 5/5 VUs, 234 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  0m51.0s/1m0s

running (0m52.0s), 5/5 VUs, 240 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  0m52.0s/1m0s

running (0m53.0s), 5/5 VUs, 245 complete and 0 interrupted iterations
constant_load   [  88% ] 5 VUs  0m53.0s/1m0s

running (0m54.0s), 5/5 VUs, 249 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  0m54.0s/1m0s

running (0m55.0s), 5/5 VUs, 256 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  0m55.0s/1m0s

running (0m56.0s), 5/5 VUs, 261 complete and 0 interrupted iterations
constant_load   [  93% ] 5 VUs  0m56.0s/1m0s

running (0m57.0s), 5/5 VUs, 266 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  0m57.0s/1m0s

running (0m58.0s), 5/5 VUs, 271 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  0m58.0s/1m0s

running (0m59.0s), 5/5 VUs, 279 complete and 0 interrupted iterations
constant_load   [  98% ] 5 VUs  0m59.0s/1m0s

running (1m00.0s), 5/5 VUs, 284 complete and 0 interrupted iterations
constant_load   [ 100% ] 5 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<5000' p(95)=887.27ms

    http_req_failed
    ✓ 'rate<0.5' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 289     4.757801/s
    checks_succeeded...: 100.00% 289 out of 289
    checks_failed......: 0.00%   0 out of 289

    ✓ created or error

    HTTP
    http_req_duration..............: avg=546.14ms min=87.07ms  med=516.79ms max=1.51s p(90)=802.84ms p(95)=887.27ms
      { expected_response:true }...: avg=546.14ms min=87.07ms  med=516.79ms max=1.51s p(90)=802.84ms p(95)=887.27ms
    http_req_failed................: 0.00%  0 out of 289
    http_reqs......................: 289    4.757801/s

    EXECUTION
    iteration_duration.............: avg=1.04s    min=588.31ms med=1.01s    max=2.01s p(90)=1.3s     p(95)=1.38s   
    iterations.....................: 289    4.757801/s
    vus............................: 5      min=5        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 221 kB 3.6 kB/s
    data_sent......................: 118 kB 1.9 kB/s



running (1m00.7s), 0/5 VUs, 289 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 5 VUs  1m0s